# Series

In [1]:
from pandas import Series, DataFrame
import pandas as pd
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [3]:
obj2 = Series([4,7,-5,3], index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [4]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [6]:
obj2*2

a     8
b    14
c   -10
d     6
dtype: int64

In [7]:
import numpy as np
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [8]:
'b' in obj2

True

In [9]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [10]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [11]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [12]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [13]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'poplution'
obj4.index.name = 'cities'
obj4

cities
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: poplution, dtype: float64

In [83]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj.index.name = ('male')
obj

male
Bob      0.0
Steve    1.0
Jeff     2.0
Ryan     3.0
dtype: float64

# DataFrame

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame2 = DataFrame(data , columns=['year','state','pop'] , index=['one','two','three','four','five'])
frame2
#frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [23]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [24]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [25]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [85]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [26]:
frame2.ix['three']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [88]:
frame2.debt='786'

In [89]:
frame2.ix['one']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2000
state    Ohio
pop       1.5
debt      786
Name: one, dtype: object

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  786
two    2001    Ohio  1.7  786
three  2002    Ohio  3.6  786
four   2001  Nevada  2.4  786
five   2002  Nevada  2.9  786

In [29]:
frame2['debt']=786

In [30]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   786
two    2001    Ohio  1.7   786
three  2002    Ohio  3.6   786
four   2001  Nevada  2.4   786
five   2002  Nevada  2.9   786

In [31]:
frame2.debt=np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [90]:
frame2.debt=np.random.randn(5)
frame2

       year   state  pop      debt
one    2000    Ohio  1.5  0.583843
two    2001    Ohio  1.7 -0.814892
three  2002    Ohio  3.6 -0.486325
four   2001  Nevada  2.4 -1.342521
five   2002  Nevada  2.9 -1.193083

In [32]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [91]:
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [34]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [35]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [36]:
del frame2['eastern']

In [37]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
#Another common form of data is a nested dict of dicts format:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [39]:
#Of course you can always transpose the result
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [40]:
'''The keys in the inner dicts are unioned and sorted to form the index in the result. This
isn’t true if an explicit index is specified:'''
DataFrame(pop, index=[2001, 2002, 2003,2004])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN
2004     NaN   NaN

In [97]:
#Dicts of Series are treated much in the same way:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
year
2001   1.7     2.4
2002   3.6     2.9

In [42]:
#For a complete list of things you can pass the DataFrame constructor
#If a DataFrame’s index and columns have their name attributes set, these will also be displayed:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [43]:
#Like Series, the values attribute returns the data contained in the DataFrame as a 2D ndarray:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [44]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

Type Notes

2D ndarray A matrix of data, passing optional row and column labels
dict of arrays, lists, or tuples Each sequence becomes a column in the DataFrame. All sequences must be the same length.
NumPy structured/record array Treated as the “dict of arrays” case
dict of Series Each value becomes a column. Indexes from each Series are unioned together to form the
result’s row index if no explicit index is passed.
dict of dicts Each inner dict becomes a column. Keys are unioned to form the row index as in the “dict of
Series” case.
list of dicts or Series Each item becomes a row in the DataFrame. Union of dict keys or Series indexes become the
DataFrame’s column labels
List of lists or tuples Treated as the “2D ndarray” case
Another DataFrame The DataFrame’s indexes are used unless different ones are passed
NumPy MaskedArray Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result

# Index Objects

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels used when constructing
a Series or DataFrame is internally converted to an Index:

In [45]:
objobj = Series(range(3))
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [46]:
obj = Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [47]:
index=obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [48]:
index[1:]

Index(['b', 'c'], dtype='object')

In [49]:
index[:1]

Index(['a'], dtype='object')

In [50]:
index = pd.Index(np.arange(5))
index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [51]:
obj2 = Series([1.2,89.9,76.7,8976.8,45.3],index=index)
obj2

0       1.2
1      89.9
2      76.7
3    8976.8
4      45.3
dtype: float64

In [52]:
obj2.index is index

True

Class Description


Index The most general Index object, representing axis labels in a NumPy array of Python objects.
Int64Index Specialized Index for integer values.
MultiIndex “Hierarchical” index object representing multiple levels of indexing on a single axis. Can be thought of
as similar to an array of tuples.
DatetimeIndex Stores nanosecond timestamps (represented using NumPy’s datetime64 dtype).
PeriodIndex Specialized Index for Period data (timespans).

In [53]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [54]:
'Ohio' in frame3.columns

True

In [55]:
2000 in frame3.index

True

Method Description



append Concatenate with additional Index objects, producing a new Index
diff Compute set difference as an Index
intersection Compute set intersection
union Compute set union
isin Compute boolean array indicating whether each value is contained in the passed collection
delete Compute new Index with element at index i deleted
drop Compute new index by deleting passed values
insert Compute new Index by inserting element at index i
is_monotonic Returns True if each element is greater than or equal to the previous element
is_unique Returns True if the Index has no duplicate values
unique Compute the array of unique values in the Index

# Reindexing

In [56]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [57]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [58]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [59]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a method such
as ffill which forward fills the values:

In [60]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(7), method='ffill') #forward fills

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
dtype: object

In [61]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 6])
obj3.reindex(range(7), method='bfill') #forward fills

0      blue
1    purple
2    purple
3    yellow
4    yellow
5    yellow
6    yellow
dtype: object

Argument Description


ffill or pad Fill (or carry) values forward
bfill or backfill Fill (or carry) values backward

In [62]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
frame.reindex(['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [64]:
frame.reindex(columns=states)

   California  Ohio  Oregon  Texas
a           2     0     NaN      1
c           5     3     NaN      4
d           8     6     NaN      7

In [65]:
#The columns can be reindexed using the columns keyword:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [66]:
frame.reindex(index=['a', 'b', 'c', 'd'],columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [67]:
#frame.ix[['a', 'b', 'c', 'd'], states]

Argument Description


index New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An
Index will be used exactly as is without any copying
method Interpolation (fill) method, see Table 5-4 for options.
fill_value Substitute value to use when introducing missing data by reindexing
limit When forward- or backfilling, maximum size gap to fill
level Match simple Index on level of MultiIndex, otherwise select subset of
copy Do not copy underlying data if new index is equivalent to old index. True by default (i.e. always copy data).

# Dropping entries from an axis

In [68]:
obj = Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [69]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [70]:
obj.drop(['a','d'])

b    1
c    2
e    4
dtype: int32

In [71]:
data = DataFrame(np.arange(16).reshape(4,4),columns=['one','two','three','four'],index=['Hyderabad','karachi','lahor','islambad'])
data

           one  two  three  four
Hyderabad    0    1      2     3
karachi      4    5      6     7
lahor        8    9     10    11
islambad    12   13     14    15

In [72]:
data.drop(['Hyderabad','lahor'])

          one  two  three  four
karachi     4    5      6     7
islambad   12   13     14    15

In [73]:
data.drop('two',axis=1)

           one  three  four
Hyderabad    0      2     3
karachi      4      6     7
lahor        8     10    11
islambad    12     14    15

In [74]:
data.drop(['two','four'],axis=1)

           one  three
Hyderabad    0      2
karachi      4      6
lahor        8     10
islambad    12     14

# Indexing, selection, and filtering

In [75]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [76]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [77]:
obj[:2]

a    0.0
b    1.0
dtype: float64

In [78]:
obj[obj>2]

d    3.0
dtype: float64

In [79]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64